Repository: xjpz/DevBar
Catalog: DevBar/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# wechat_no_accounts
source: 暂无账号，添加一个开始使用
en: No accounts. Add one to get started.

# wechat_no_agent_configured
source: 未配置代理
en: No agent configured

# wechat_no_agents
source: 未配置 AI 代理
en: No agents configured

# wechat_open_log_file
source: 查看完整日志
en: Open Full Log

# wechat_qr_decode_error
source: 二维码解码失败
en: Failed to decode QR code image

# wechat_qr_expired
source: 二维码已过期
en: QR code expired

# wechat_restart
source: 重启
en: Restart

# wechat_retry
source: 重试
en: Retry

# wechat_scan_agents
source: 自动检测
en: Auto Detect

# wechat_scanned
source: 已扫码，请在手机确认...
en: Scanned! Confirm on phone...

# wechat_session_expired
source: 会话已过期
en: Session expired

# wechat_status
source: 状态
en: Status

# wechat_waiting_scan
source: 等待扫码...
en: Waiting for scan...

# widget_description
source: 一览 BigModel 用量额度。
en: View your BigModel usage quota at a glance.

# widget_description_glm
source: 一览 GLM 用量额度。
en: View GLM usage quota at a glance.

# widget_description_openai
source: 一览 OpenAI 用量额度。
en: View OpenAI usage quota at a glance.

# widget_guide_description
source: 打开通知中心，编辑小组件添加 DevBar。
en: Open Notification Center and edit widgets to add DevBar.

# widget_guide_title
source: 通知中心小组件
en: Notification Center Widget

# widget_last_updated %@
source: 更新时间 %@
en: Updated %@

# widget_name
source: DevBar 额度
en: DevBar Quota

# widget_not_logged_in
source: 打开 DevBar 登录
en: Open DevBar to log in

# widget_percent_used
source: 已使用 %d%%
en: %d%% used

# widget_reset_at
source: 重置: %@
en: Reset: %@

# widget_waiting_data
source: 等待数据...
en: Waiting for data...

source: Word 文档 (.docx)
en: Word Document (.docx)

source: 一切正常
en: All Good

source: 一句话上岛
en: One-Line Live Message

source: 上一页
en: Previous Page

source: 上岛
en: Start Live Message

source: 下一页
en: Next Page

source: 中继日志
en: Relay Log

source: 中继未连接
en: Relay Not Connected

source: 中继连接失败
en: Relay Connection Failed

source: 二维码包含账号凭证，只建议在你自己的可信设备之间迁移。
en: The QR code contains account credentials. Only transfer it between your own trusted devices.

source: 二维码生成失败
en: Failed to Generate QR Code

source: 任务卡住
en: Task Stalled

source: 任务失败
en: Task Failed

source: 任务完成
en: Task Completed

source: 任务等待处理
en: Task Needs Attention

source: 优先显示需要处理的任务
en: Prioritize tasks that need attention

source: 会话开始
en: Session Started

source: 使用说明
en: Instructions

source: 停止
en: Stop

source: 允许
en: Allow

source: 允许离线推送
en: Allow Offline Push

source: 全量同步
en: Full Sync

source: 关闭
en: Close

source: 关闭 hooks 通知后仍会记录等待状态和更新状态中心，但不会发送 Mac 或 iPhone 通知。
en: When hooks notifications are off, waiting states and Status Center updates are still recorded, but Mac and iPhone notifications are not sent.

source: 关闭显示器
en: Turn Off Display

source: 关闭电脑显示器
en: Turn Off Mac Display

source: 最近事件
en: Recent Events

source: 最近同步 %@
en: Last synced %1$@

source: 最近授权
en: Recent Approvals

source: 切换 AI 额度 Provider 页
en: Switch AI Quota Provider Page

source: 切换 Mac 主题额度 Provider 页
en: Switch Mac Theme Quota Provider Page

source: 切换小组件页面
en: Switch Widget Page

source: 刚刚
en: Just now

source: 删除账号
en: Delete Account

source: 刷新
en: Refresh

source: 剩余
en: Remaining

source: 包含 Provider：%@
en: Includes Providers: %1$@

source: 匹配关键词
en: Matched Keyword

source: 发送
en: Send

source: 发送人
en: Sender

source: 发送任务到在线 Mac
en: Send Tasks to Online Macs

source: 取消
en: Cancel

source: 只提醒 Mac
en: Mac Only

source: 只读适合远程问答；工作区写入允许 Codex 修改当前工作目录下文件，仍会走授权确认。
en: Read-only is suitable for remote Q&A. Workspace write lets Codex modify files in the current working directory, with approval still required.

source: 可用重置:
en: Available resets:

source: 启用 Agent Watcher
en: Enable Agent Watcher

source: 命令确认
en: Command Confirmation

source: 在 AI 额度小组件内切换 Provider 分页。
en: Switch provider pages in the AI Quota widget.

source: 在 Finder 中右键即可使用这些功能。需在系统设置 > 扩展中启用 DevBar Finder Extension。
en: Right-click in Finder to use these features. Enable DevBar Finder Extension in System Settings > Extensions.

source: 在 Mac 主题小组件内切换 AI 额度 Provider 分页。
en: Switch AI quota provider pages in the Mac Theme widget.

source: 在一个大号小组件里查看 AI 额度和电脑控制入口。
en: View AI quotas and Mac controls in one large widget.

source: 在小组件内切换显示页面。
en: Switch the displayed page in the widget.

source: 在线
en: Online

source: 在线 · %@
en: Online · %1$@

source: 失败
en: Failed

source: 如果二维码过期，请关闭后重新生成。
en: If the QR code expires, close this and generate a new one.

source: 安全中继二维码
en: Secure Relay QR Code

source: 安静模式
en: Quiet Mode

source: 完成
en: Done

source: 导入到 iPhone
en: Import to iPhone

source: 小组件内容
en: Widget Content

source: 尚未绑定 iPhone。生成二维码后，用 iPhone DevBar 扫描完成配对。
en: No iPhone is paired yet. Generate a QR code, then scan it with DevBar on iPhone to pair.

source: 屏幕：%@
en: Screen: %1$@

source: 工具
en: Tool

source: 工具: %@
en: Tool: %1$@

source: 工具：%@
en: Tool: %1$@

source: 工具执行前
en: Before Tool Use

source: 工具执行后
en: After Tool Use

source: 已卡住
en: Stalled

source: 已同步 %lld 个 Provider
en: %1$lld providers synced

source: 已完成
en: Completed

source: 已检测到
en: Detected

source: 当前使用安全中继：账号凭证已在本机加密，服务端只临时保存密文。
en: Using secure relay: account credentials are encrypted on this device, and the server only stores ciphertext temporarily.

source: 当前工作目录
en: Current Working Directory

source: 当前没有需要处理的任务
en: No tasks need attention right now

source: 待授权
en: Pending Approval

source: 快速设置
en: Quick Settings

source: 所有 Agent 事件都提醒 iPhone
en: Notify iPhone for all agent events.

source: 所有任务运行正常
en: All tasks are running normally

source: 扫一扫
en: Scan

source: 扫描 Mac DevBar 里的连接二维码后，这里会显示已绑定 Mac。
en: After scanning the connection QR code from DevBar on Mac, paired Macs will appear here.

source: 把快捷指令收到的短信内容提交到 DevBar 服务端，优先通过 Relay 转发到已配对电脑，离线时使用系统通知兜底。
en: Send SMS content from Shortcuts to the DevBar server. It is forwarded to paired Macs through Relay first, with system notifications as the offline fallback.

source: 拒绝
en: Deny

source: 拷贝文件路径
en: Copy File Path

source: 授权
en: Approval

source: 接入状态
en: Connection Status

source: 推荐
en: Recommended

source: 推送通知
en: Push Notifications

source: 提交代码、写文件、删除、安装、执行等高风险操作也可通过微信 Y 放行
en: High-risk actions such as committing code, writing files, deleting, installing, and running commands can also be approved with Y in WeChat.

source: 操作：%@
en: Operation: %1$@

source: 文件权限
en: File Permission

source: 文件类型
en: File Type

source: 方向
en: Direction

source: 显示二维码
en: Show QR Code

source: 显示内容
en: Display Content

source: 显示活跃和等待任务数量
en: Show active and waiting task counts

source: 智能提醒
en: Smart Alerts

source: 暂无中继日志
en: No relay logs yet

source: 暂无事件
en: No events yet

source: 未检测到
en: Not Detected

source: 未添加授权目录
en: No authorized directories added

source: 未知
en: Unknown

source: 本地连接
en: Local Connection

source: 权限请求
en: Permission Request

source: 来源：%@
en: Source: %1$@

source: 标记已处理
en: Mark as Handled

source: 桌面小组件
en: Desktop Widgets

source: 正在执行 %@
en: Running %1$@

source: 正在读取二维码...
en: Reading QR code...

source: 正在读取迁移配置...
en: Reading transfer configuration...

source: 沙盒
en: Sandbox

source: 没有可用的 %@ 命令
en: No available %1$@ command

source: 液态玻璃
en: Liquid Glass

source: 深色
en: Dark

source: 添加 Provider 账号
en: Add Provider Account

source: 添加到桌面后，可编辑并选择 Provider 额度、Agent Watcher、Mac 主题或翻页时钟。
en: After adding it to the desktop, edit it to choose Provider Quota, Agent Watcher, Mac Theme, or Flip Clock.

source: 添加可切换目录
en: Add Switchable Directory

source: 添加目录时会同时验证 DevBar 和外部 CLI 子进程访问权限。若目录位于文稿、桌面、下载或 iCloud，系统授权会在这里完成，避免远程首次访问才弹窗。
en: When adding a directory, DevBar also verifies access for external CLI child processes. If it is in Documents, Desktop, Downloads, or iCloud, system authorization is completed here to avoid a first remote access prompt.

source: 灵动岛
en: Dynamic Island

source: 点亮电脑
en: Wake Mac

source: 点击任意值复制到剪贴板。
en: Click any value to copy it to the clipboard.

source: 生成一个 5 分钟内有效的二维码，在 iPhone 上扫码导入当前配置。
en: Generate a QR code valid for 5 minutes, then scan it on iPhone to import the current configuration.

source: 用 iPhone DevBar 扫描二维码完成配对。二维码不包含设备密钥，过期后请重新生成。
en: Scan the QR code with DevBar on iPhone to pair. The QR code does not contain the device key; generate a new one after it expires.

source: 用于区分同一个 Provider 下的多个账号
en: Used to distinguish multiple accounts under the same provider

source: 用户输入
en: User Input

source: 电脑
en: Mac

source: 电脑控制台
en: Mac Console

source: 监控 AI 任务状态，查看是否有任务等待处理
en: Monitor AI task status and see whether any tasks need attention

source: 短信内容
en: SMS Content

source: 短信提醒
en: SMS Alerts

source: 离线
en: Offline

source: 离线二维码
en: Offline QR Code

source: 离线通知使用已绑定 Relay iPhone；图标仅支持 HTTPS URL。
en: Offline notifications use the paired Relay iPhone. Icons only support HTTPS URLs.

source: 移除头像
en: Remove Avatar

source: 空闲
en: Idle

source: 等待 %@
en: Waiting for %1$@

source: 等待: %@
en: Waiting: %1$@

source: 等待中
en: Waiting

source: 等待你处理
en: Waiting for You

source: 等待处理
en: Needs Attention

source: 等待授权、登录失效、任务失败会推送到 iPhone
en: Pending approvals, expired logins, and task failures are pushed to iPhone.

source: 等待输入
en: Waiting for Input

source: 等待额度同步
en: Waiting for quota sync

source: 结束
en: End

source: 网络权限
en: Network Permission

source: 翻页时钟
en: Flip Clock

source: 设备与小组件
en: Devices and Widgets

source: 设备与系统表面
en: Devices and System Surfaces

source: 读取 config.toml 失败: %@
en: Failed to read config.toml: %1$@

source: 读取 hooks.json 失败: %@
en: Failed to read hooks.json: %1$@

source: 读取配置失败: %@
en: Failed to read configuration: %1$@

source: 调试信息
en: Debug Info

source: 转发短信提醒
en: Forward SMS Alerts

source: 输入要显示在灵动岛的一句文案
en: Enter a line to show in Dynamic Island

source: 迁移到 iPhone
en: Transfer to iPhone

source: 过期时间：%@
en: Expires: %1$@

source: 运行中
en: Running

source: 运行概览
en: Run Overview

source: 运行正常
en: Running Normally

source: 这些信息会用于 Mac 主题小组件和 Relay 设备识别。
en: This information is used by the Mac Theme widget and Relay device identification.

source: 远程中继
en: Remote Relay

source: 远程可切换目录
en: Remote Switchable Directories

source: 远程控制
en: Remote Control

source: 远程设备
en: Remote Devices

source: 连接 iPhone
en: Connect iPhone

source: 连接中
en: Connecting

source: 选择 Agent Watcher 小组件显示的内容。
en: Choose what the Agent Watcher widget displays.

source: 选择头像
en: Choose Avatar

source: 选择当前工作目录，所选目录会加入远程可用目录
en: Choose the current working directory. The selected directory will be added to remote available directories.

source: 选择桌面小组件显示的内容。
en: Choose what the desktop widget displays.

source: 选择默认页面和 AI 额度提供方。
en: Choose the default page and AI quota provider.

source: 透明
en: Transparent

source: 透明小组件
en: Transparent Widget

source: 通知
en: Notification

source: 通知与远程触达
en: Notifications and Remote Reachability

source: 通知标题
en: Notification Title

source: 通知模式
en: Notification Mode

source: 通过 DevBar Relay 关闭已配对电脑的显示器。
en: Turn off the paired Mac display through DevBar Relay.

source: 通过 DevBar Relay 点亮已配对电脑的显示器。
en: Wake the paired Mac display through DevBar Relay.

source: 通过 DevBar Relay 锁定已配对的电脑。
en: Lock the paired Mac through DevBar Relay.

source: 鄂ICP备2021013794号-4A
en: E ICP No. 2021013794-4A

source: 配对码：%@
en: Pairing Code: %1$@

source: 配置
en: Settings

source: 配额警告
en: Quota Warning

source: 重新检测
en: Detect Again

source: 重要事件同步 iPhone
en: Sync Important Events to iPhone

source: 重要事件立即提醒，普通事件只显示 Badge，重复事件节流
en: Important events notify immediately; normal events only update the badge, and repeated events are throttled.

source: 锁定
en: Lock

source: 锁定 %@
en: Lock %1$@

source: 锁定 Mac？
en: Lock Mac?

source: 锁屏电脑
en: Lock Mac

source: 错误
en: Error

source: 需要登录
en: Login Required

source: 需重新授权
en: Reauthorization Required

source: 静音
en: Silent

source: 页面
en: Page

source: 额度自动刷新间隔
en: Quota Auto-Refresh Interval

source: 高频事件摘要
en: High-Frequency Event Summary

source: 高风险也允许微信确认
en: Allow WeChat confirmation for high-risk actions

source: 默认安全目录: %@
en: Default safe directory: %1$@

source: 默认终端
en: Default Terminal

source: 默认页面
en: Default Page
